
ആവട്ടെ മുതലാളി  = {
    പേര്: "ഗംഗാധരൻ മുതലാളി ",
    ജോലി : "",
    സംഭാഷണം : (സീൻ) => {
    തിരിക്കുക(സീൻ){
        അടിസ്ഥാനം:
            മടക്കം "";
        മുടക്കുക;
    }
}
};
ആവട്ടെ രമണൻ = {
    പേര്: "രമണൻ",
    ജോലി : "ഗംഗാധരൻ മുതലാളീടെ ബോട്ടിൽ ",
    സംഭാഷണം : (സീൻ) => {
        തിരിക്കുക(സീൻ){
            അവസ്ഥ("മുതലാളി ചെറ്റ"):
                മടക്കം "രമണൻ: മുതലാളീ,  പറയുന്നത് കൊണ്ട് ഒന്നും തോന്നരുത്. മുതലാളി ഒരു ചെറ്റ ആണ് !!";
                മുടക്കുക;
            അവസ്ഥ("പണി"):
                മടക്കം "രമണൻ: തീരുമ്പോൾ തീരുമ്പോൾ പണി താരം ഞാൻ എന്താ കുപ്പിന്നു വന്ന ഭൂതമാണോ ?";
                മുടക്കുക;
            അടിസ്ഥാനം:
                മടക്കം "";
                മുടക്കുക;
        }


    }
};


ആക്ഷൻ = പ്രയോഗം(കഥാപാത്രം, സീൻ){
    കാണിക്കുക(കഥാപാത്രം, സീൻ);
    പരിവര്‍ത്തനം ഡയലോഗ്;
    ആണെങ്കിൽ(കഥാപാത്രം == 'രമണൻ'){
        ഡയലോഗ് = രമണൻ.സംഭാഷണം(സീൻ);
    }അല്ലെങ്കിൽ{
        ഡയലോഗ് = മുതലാളി.സംഭാഷണം(സീൻ);
    }
    var node = document.createElement("LI");
    node.innerHTML = ഡയലോഗ്;
    document.getElementById('dialogues').appendChild(node);
};
